; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-17-15)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room1)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room9)
(at ball2 room8)
(at ball3 room15)
(at ball4 room10)
(at ball5 room12)
(at ball6 room3)
(at ball7 room13)
(at ball8 room12)
(at ball9 room9)
(at ball10 room13)
(at ball11 room11)
(at ball12 room4)
(at ball13 room6)
(at ball14 room3)
(at ball15 room10)
)
(:goal
(and
(at ball1 room11)
(at ball2 room16)
(at ball3 room15)
(at ball4 room8)
(at ball5 room7)
(at ball6 room15)
(at ball7 room13)
(at ball8 room16)
(at ball9 room16)
(at ball10 room14)
(at ball11 room17)
(at ball12 room4)
(at ball13 room10)
(at ball14 room3)
(at ball15 room5)
)
)
)

; plan
1. (move robot1 room1 room9)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room9)
   goals met: 4 of 15
2. (move robot2 room1 room9)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room9)
   goals met: 4 of 15
3. (pick robot1 ball9 room9 lgripper1)
   deleted: (at ball9 room9) (free robot1 lgripper1)
   added: (carry robot1 ball9 lgripper1)
   goals met: 4 of 15
4. (pick robot2 ball1 room9 lgripper2)
   deleted: (at ball1 room9) (free robot2 lgripper2)
   added: (carry robot2 ball1 lgripper2)
   goals met: 4 of 15
5. (move robot1 room9 room16)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room16)
   goals met: 4 of 15
6. (move robot2 room9 room3)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room3)
   goals met: 4 of 15
7. (drop robot1 ball9 room16 lgripper1)
   deleted: (carry robot1 ball9 lgripper1)
   added: (at ball9 room16) (free robot1 lgripper1)
   goals met: 5 of 15
8. (pick robot2 ball6 room3 rgripper2)
   deleted: (at ball6 room3) (free robot2 rgripper2)
   added: (carry robot2 ball6 rgripper2)
   goals met: 5 of 15
9. (move robot2 room3 room15)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room15)
   goals met: 5 of 15
10. (move robot1 room16 room8)
   deleted: (at-robby robot1 room16)
   added: (at-robby robot1 room8)
   goals met: 5 of 15
11. (drop robot2 ball6 room15 rgripper2)
   deleted: (carry robot2 ball6 rgripper2)
   added: (at ball6 room15) (free robot2 rgripper2)
   goals met: 6 of 15
12. (pick robot1 ball2 room8 lgripper1)
   deleted: (at ball2 room8) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 6 of 15
13. (move robot2 room15 room11)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room11)
   goals met: 6 of 15
14. (move robot1 room8 room12)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room12)
   goals met: 6 of 15
15. (drop robot2 ball1 room11 lgripper2)
   deleted: (carry robot2 ball1 lgripper2)
   added: (at ball1 room11) (free robot2 lgripper2)
   goals met: 7 of 15
16. (pick robot2 ball11 room11 rgripper2)
   deleted: (at ball11 room11) (free robot2 rgripper2)
   added: (carry robot2 ball11 rgripper2)
   goals met: 7 of 15
17. (pick robot1 ball8 room12 rgripper1)
   deleted: (at ball8 room12) (free robot1 rgripper1)
   added: (carry robot1 ball8 rgripper1)
   goals met: 7 of 15
18. (move robot2 room11 room17)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room17)
   goals met: 7 of 15
19. (move robot1 room12 room16)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room16)
   goals met: 7 of 15
20. (drop robot2 ball11 room17 rgripper2)
   deleted: (carry robot2 ball11 rgripper2)
   added: (at ball11 room17) (free robot2 rgripper2)
   goals met: 8 of 15
21. (drop robot1 ball8 room16 rgripper1)
   deleted: (carry robot1 ball8 rgripper1)
   added: (at ball8 room16) (free robot1 rgripper1)
   goals met: 9 of 15
22. (drop robot1 ball2 room16 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room16) (free robot1 lgripper1)
   goals met: 10 of 15
23. (move robot1 room16 room8)
   deleted: (at-robby robot1 room16)
   added: (at-robby robot1 room8)
   goals met: 10 of 15
24. (move robot2 room17 room8)
   deleted: (at-robby robot2 room17)
   added: (at-robby robot2 room8)
   goals met: 10 of 15
25. (move robot1 room8 room13)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room13)
   goals met: 10 of 15
26. (move robot2 room8 room6)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room6)
   goals met: 10 of 15
27. (pick robot1 ball10 room13 lgripper1)
   deleted: (at ball10 room13) (free robot1 lgripper1)
   added: (carry robot1 ball10 lgripper1)
   goals met: 10 of 15
28. (pick robot2 ball13 room6 lgripper2)
   deleted: (at ball13 room6) (free robot2 lgripper2)
   added: (carry robot2 ball13 lgripper2)
   goals met: 10 of 15
29. (move robot1 room13 room14)
   deleted: (at-robby robot1 room13)
   added: (at-robby robot1 room14)
   goals met: 10 of 15
30. (move robot2 room6 room12)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room12)
   goals met: 10 of 15
31. (drop robot1 ball10 room14 lgripper1)
   deleted: (carry robot1 ball10 lgripper1)
   added: (at ball10 room14) (free robot1 lgripper1)
   goals met: 11 of 15
32. (pick robot2 ball5 room12 rgripper2)
   deleted: (at ball5 room12) (free robot2 rgripper2)
   added: (carry robot2 ball5 rgripper2)
   goals met: 11 of 15
33. (move robot2 room12 room7)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room7)
   goals met: 11 of 15
34. (move robot1 room14 room5)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room5)
   goals met: 11 of 15
35. (drop robot2 ball5 room7 rgripper2)
   deleted: (carry robot2 ball5 rgripper2)
   added: (at ball5 room7) (free robot2 rgripper2)
   goals met: 12 of 15
36. (move robot1 room5 room8)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room8)
   goals met: 12 of 15
37. (move robot2 room7 room10)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room10)
   goals met: 12 of 15
38. (move robot1 room8 room10)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room10)
   goals met: 12 of 15
39. (drop robot2 ball13 room10 lgripper2)
   deleted: (carry robot2 ball13 lgripper2)
   added: (at ball13 room10) (free robot2 lgripper2)
   goals met: 13 of 15
40. (pick robot2 ball15 room10 rgripper2)
   deleted: (at ball15 room10) (free robot2 rgripper2)
   added: (carry robot2 ball15 rgripper2)
   goals met: 13 of 15
41. (pick robot1 ball4 room10 lgripper1)
   deleted: (at ball4 room10) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 13 of 15
42. (move robot2 room10 room5)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room5)
   goals met: 13 of 15
43. (move robot1 room10 room8)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room8)
   goals met: 13 of 15
44. (drop robot2 ball15 room5 rgripper2)
   deleted: (carry robot2 ball15 rgripper2)
   added: (at ball15 room5) (free robot2 rgripper2)
   goals met: 14 of 15
45. (drop robot1 ball4 room8 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room8) (free robot1 lgripper1)
   goals met: 15 of 15
